---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsDetailed
source: html/0a36101d-7ce2-c7b5-7e94-ae2b824d10c4.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsDetailed Method

Checks if StructuralConnectionHandlerType is detailed.

## Syntax (C#)
```csharp
public bool IsDetailed()
```

## Returns
True if StructuralConnectionHandlerType is detailed.